RIET/src/Catalogs/Warehouses/Warehouses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Warehouses</name>
  <predefined>
    <items>
      <name>Other</name>
      <description>NOT IN LIST (MANUAL INPUT)</description>
    </items>
    <items>
      <name>UNKN</name>
      <description>UNKNOWN</description>
    </items>
  </predefined>
  <attributes>
    <name>InTMS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CountryCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RCACountry</name>
    <type>
      <types>CatalogRef.CountriesOfProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>ProcessLevel</name>
    <type>
      <types>CatalogRef.ProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>City</name>
    <type>
      <types>CatalogRef.Cities</types>
    </type>
  </attributes>
  <attributes>
    <name>Address1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Address2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Address3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ContactName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ContactPhone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ContactEMail</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Warehouse</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Port</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AddressRus</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NameRus</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Latitude</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Longitude</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RegionProvince</name>
    <type>
      <types>CatalogRef.RegionProvince</types>
    </type>
  </attributes>
  <attributes>
    <name>FacilityType</name>
    <type>
      <types>CatalogRef.FacilityTypes</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Roles</name>
    <attributes>
      <name>Role</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RIET/src/Catalogs/Warehouses/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////
// ПРИ КОПИРОВАНИИ

Процедура ПриКопировании(ОбъектКопирования)
	
	РГСофт.ОчиститьCreationModification(ЭтотОбъект);
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////////////////////
// ПЕРЕД ЗАПИСЬЮ

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДозаполнитьРеквизитыБезДополнительныхДанных();
	
	ПроверитьРеквизитыБезДополнительныхДанных(Отказ);
		
КонецПроцедуры

Процедура ДозаполнитьРеквизитыБезДополнительныхДанных()
	
	Код = СокрЛП(Код);
	
	Наименование = СокрЛП(Наименование);
	
	CountryCode = СокрЛП(CountryCode);
	
	Если ЗначениеЗаполнено(CountryCode) И НЕ ЗначениеЗаполнено(RCACountry) Тогда
		RCACountry = ImportExportСерверПовтИспСеанс.ПолучитьRCACountryПоTMSID(CountryCode); 	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(RCACountry) И НЕ ЗначениеЗаполнено(ProcessLevel) Тогда
		ProcessLevel = ImportExportСерверПовтИспСеанс.ПолучитьProcessLevelПоRCACountry(RCACountry);	
	КонецЕсли;
	
	Address1 = СокрЛП(Address1);
	Address2 = СокрЛП(Address2);
	Address3 = СокрЛП(Address3);
	AddressRus = СокрЛП(AddressRus);
	
	Если ЭтоНовый() Тогда		
		РГСофт.ЗаполнитьCreation(ЭтотОбъект);		
	КонецЕсли;
	
	Для Каждого СтрокаRoles Из Roles Цикл
		СтрокаRoles.Role = СокрЛП(СтрокаRoles.Role);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьРеквизитыБезДополнительныхДанных(Отказ)
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СокрЛП(Код)) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"'Code / TMS Id' is empty!",
			ЭтотОбъект, "Код", , Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"'Name' is empty!",
			ЭтотОбъект, "Наименование", , Отказ);		
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(CountryCode) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"'Country code' is empty!",
			ЭтотОбъект, "CountryCode", , Отказ);		
	КонецЕсли;
		
	Если НЕ InTMS И НЕ ЗначениеЗаполнено(City) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"'City' is empty!",
			ЭтотОбъект, "City", , Отказ);		
	КонецЕсли;
	
	Если НЕ InTMS И НЕ ЗначениеЗаполнено(Address1) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"'Address 1' is empty!",
			ЭтотОбъект, "Address1", , Отказ);		
	КонецЕсли;
	
	Если НЕ InTMS И Warehouse Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"'Warehouse' is used only for In TMS locations!",
			ЭтотОбъект, "Warehouse", , Отказ);		
	КонецЕсли;

	Если НЕ InTMS И Port Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"'Port' is used only for In TMS locations!",
			ЭтотОбъект, "Port", , Отказ);		
	КонецЕсли;
		
КонецПроцедуры
